# Вычислить число Пи c заданной точностью d
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

import os
os.system('cls')
import math
from math import pi

d = input('Введите заданную точность d от 0.1 до 0.0000000001: ')
d = d[2:len(d)]
lst = list(d)
n = int(len(lst))

print('pi_from_PY = ', pi)

# Формула Бэйли—Боруэйна—Плаффа
my_pi = sum(1/16**x*(4/(8*x + 1) - 2/(8*x + 4) - 1/(8*x + 5) - 1/(8*x + 6)) for x in range(n))
print('my_pi = ', my_pi)

print('real_pi = 3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679')